#include <iostream> 
using namespace std;
int main() {
	//If1.Дано целое число.Если оно является положительным, то прибавить к
	//нему 1; в противном случае не изменять его.Вывести полученное число.
	/*int a;
	cin >> a;
	if (a > 0) {
		a + 1;// a = a + 1; a++
	}
	cout << a << endl;*/
	//If2.Дано целое число.Если оно является положительным, то прибавить к
	//нему 1; в противном случае вычесть из него 2. Вывести полученное число.
	/*int a;
	cin >> a;
	if (a > 0) {
		a += 1;
	}
	else {
		a -= 2; // a = a - 2
	}
	cout << a << endl;*/
	//If3.Дано целое число.Если оно является положительным, то прибавить к
	//нему 1; если отрицательным, то вычесть из него 2; если нулевым, то
	//заменить его на 10. Вывести полученное число
	/*int a;
	cin >> a;
	if (a > 0) {
		a++;
	}
	else {
		if (a < 0) {
			a -= 2;
		}
		else if (a == 0) {
			a = 10;
		}
		cout << a << endl;*/
	}
	//If4◦.Даны три целых числа.Найти количество положительных чисел в исходном наборе.
	/*int a, b, c;
	int k = 0;
	if (a > 0) {
		k++;
	}
	if (b > 0) {
		k++;
	}
	if (c > 0) {
		k++;
	}
	cout << a << endl;*/
	//If6◦.Даны два числа.Вывести большее из них.
	/*int a, b;
	cin >> a >> b; 
	if (a > b) {
		cout << a << endl;
	}
	else if (b > a) {
		cout << b << endl;
	}
	else if (a == b) {
		cout << "=" << endl;*/
	/*}
	//If5.Даны три целых числа.Найти количество положительных и количество отрицательных чисел в исходном наборе.
	/*int a, b, c;
	int k = 0;
	if (a < 0) {
		k++;
	}
	if (b < 0) {
		k++;
	}
	if (c < 0) {
		k++;
	}
	cout << "Количество положительных" << a << endl;
	int e = 0;
	if (a < 0) {
		e++;
	}
	if (b < 0) {
		e++;
	}
	if (c < 0) {
		e++;
	}
	cout << "Количество положительных" << b << endl;*/

	//If10.Даны две переменные целого типа : A и B.Если их значения не равны,
//то присвоить каждой переменной сумму этих значений, а если равны,
//то присвоить переменным нулевые значения.Вывести новые значения
//переменных A и B.
	/*int a, b;
	cin >> a >> b;
	if (a != b) {
		a = a + b;
		b = a + b;
	}
	if (a == b) {
		a = 0;
		b = 0;
		cout << a << " " << b << endl;
	}
}
//If8◦.Даны два числа.Вывести вначале большее, а затем меньшее из них.
/*int a, b;
cin >> a >> b;
if (a > b)
cout << a <<" " << b << endl;
if (a < b)
	cout << a << " " << b << endl;*/
//If9.Даны две переменные вещественного типа : A, B.Перераспределить значения данных переменных так, чтобы в A оказалось меньшее из значений,
//а в B — большее.Вывести новые значения переменных A и B.
/*double a, b;
cin >> a >> b;
if (a > b) {
	c = b;
		b = a;
		a = c;
		cout << b << " " << a << endl; */


